<?php

//4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания
// (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
//Написать функцию транслитерации строк.

$arr = ["а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "yo", "ж" => "zh", "з" => "z",
	"и" => "i", "й" => "j", "к" => "k", "л" => "l", "м" => "m", "н" => "n","о" => "o", "п" => "p", "р" => "r", "с" => "s",
	"т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "cz", "ч" => "ch", "ш" => "sh", "щ" => "shh", "ъ" => "''",
	"ы" => "y", "ь" => "'", "э" => "e", "ю" => "yu", "я" => "ya"];

echo transliterate("Превед медвед!" ,$arr);

function transliterate($word, $arr) {
	// переводим в нижний регистр
	$word = mb_strtolower ($word);
	// заменяем текст на транслит и возвращаем
	return strtr($word, $arr);
}

?>