<?php
header('Content-Type: text/html; charset=utf-8');

//8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

$arr = ["Московская область" => ["Москва", "Зеленоград", "Клин"],
	"Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
	"Рязанская область" => ["Рязань", "Касимов", "Сасово", "Ряжск"]
];
// перебираем регионы
foreach ($arr as $grp => $regions) {
	echo $grp.": \n";
	// перебираем города
	foreach ($regions as $city) {
		// получаем первую букву города
		$cityFirstLetter = mb_substr($city, 0, 1, "UTF-8");
		// если город начинается на букву "К"
		if ($cityFirstLetter == 'К') {
			// то выводим данный город
			echo $city.", ";
		}
	}
	echo "\n";
}

?>