<?php
//9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке,
// производит транслитерацию и замену пробелов на подчеркивания
// (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).

$arrForTranslit = ["а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "yo", "ж" => "zh", "з" => "z",
	"и" => "i", "й" => "j", "к" => "k", "л" => "l", "м" => "m", "н" => "n","о" => "o", "п" => "p", "р" => "r", "с" => "s",
	"т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "cz", "ч" => "ch", "ш" => "sh", "щ" => "shh", "ъ" => "''",
	"ы" => "y", "ь" => "'", "э" => "e", "ю" => "yu", "я" => "ya"];

$text = "аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах";

$text = replaceSpace($text);
$text = transliterate($text, $arrForTranslit);
echo $text;

/** функция заменяет пробел на нижнее подчеркивание
 * @param $phrase - строка для изменения
 * @return mixed - измененная строка
 */
function replaceSpace($phrase) {
	// разбираем строку на массив, разделителем устанавливаем пробел
	$newtext =  explode(" ", $phrase);
	// объединяем элементы массива в строку, со вставкой нижнего подчеркивания
	$newtext = implode("_", $newtext);
	return $newtext;
}

/** Функция переводит в транслит в строку
 * @param $subject {str} - строка для перевода в транслит
 * @param $arr {arr} -  массив содержащий кирилич буквы и их аналоги на латинице
 * @return string {str} - строка переведенная в транслит
 */
function transliterate($subject, $arr) {
	// переводим в нижний регистр
	$subject = mb_strtolower ($subject);
	// заменяем текст на транслит и возвращаем
	return strtr($subject, $arr);
}
?>